app/Http/Controllers/Backend/Product/ProductController.php

    public function getCategories()
    {
        return ProductCategory::all(['id', 'name']);
---
select `id`, `name` from `product_categories` where `product_categories`.`deleted_at` is null