app/Http/Controllers/Frontend/HomeController.php

select * from `testimonials`
---
    public function index()
    {
        $appointmentSections = Appointment::get();
        $subCategories = ServiceSubCategory::where('service_category_id', 1)->with('serviceCategory')->get();
        $products = Product::mappedProducts(['product_category_id' => 1]);
        $banners = getRecords('banners');
        $infos1 = Info::where('section_id', 1)->get();
        $infos2 = Info::where('section_id', 2)->get();
        $testimonials = Testimonial::get();