app/Http/Controllers/Frontend/HomeController.php

select * from `banners`
select * from `appointments`
select * from `product_categories` where `product_categories`.`id` = 1 and `product_categories`.`deleted_at` is null limit 1
select * from `product_sub_categories` where `product_sub_categories`.`product_category_id` in (1) and `product_sub_categories`.`deleted_at` is null
select * from `infos` where `section_id` = 1
select * from `social_handles` where `social_handles`.`deleted_at` is null
---
    public function index()
    {
        $banners = Banner::get();
        $appointmentSections = Appointment::get();
        $productCategory = ProductCategory::with('productSubCategories', "productSubCategories.products")->find(1);
        $infos1 = Info::where('section_id', 1)->get();
        $infos2 = Info::where('section_id', 2)->get();
        $socials = SocialHandle::get();