app/Http/Controllers/SocialHandleController.php

    public function index()
    {
        $socials = SocialHandle::get();
---
select * from `social_handles` where `social_handles`.`deleted_at` is null

    public function edit(SocialHandle $socialHandle)
    {
        $socials = SocialHandle::get();
---
select * from `social_handles` where `social_handles`.`deleted_at` is null

    public function destroy(SocialHandle $socialHandle)
    {
        $socialHandle->delete();
---
update `social_handles` set `deleted_at` = '2023-05-07 12:27:13', `social_handles`.`updated_at` = '2023-05-07 12:27:13' where `id` = 7